AcDbCompoundObjectId.nullId
Returns an empty AcDbCompoundObjectId.

AcDbCompoundObjectId.dxfInFields(AcDbDxfFiler*,AcDbDatabase*,System.Int32)
Remarks:
The ownerVersion greater or equal to 0 means the new format, less than 0
means the old format (w/o the class name and object version) that we need
to maintain only to be able to read Beta1/2 drawings.

AcDbCompoundObjectId.dwgInFields(AcDbDwgFiler*,System.Int32)
Remarks:
The ownerVersion greater or equal to 0 means the new format, less than 0
means the old format (w/o the class name and object version) that we need
to maintain only to be able to read Beta1/2 drawings.

AcDbCompoundObjectId.remap(AcDbIdMapping!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Remaps all the AcDbObjectIds in this AcDbCompoundObjectId by
the given AcDbIdMapping. Returns true if any remapping actually happened,
false otherwise.
idMap:  See the description of the AcDbIdMapping class.
Returns:  True if some ids actually changed, false otherwise.

AcDbCompoundObjectId.getTransform(AcGeMatrix3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the compound transform from the leaf object to the world,
concatennating all the AcDbBlockReference transforms, from the most nested
one to the topmost one. This transformation represents mapping of the
coordinates of the leaf-level object from its AcDbBlockTableRecord
coordinate space to the world coordinate space.
trans:  The returned compound transform.
Returns:  Acad::ErrorStatus.

AcDbCompoundObjectId.isSimpleObjectId
Returns true if there is no path, only the leaf id (which may be null).

AcDbCompoundObjectId.isExternal
Returns true if the AcDbCompoundObjectId is from an external
drawing.

AcDbCompoundObjectId.isValid(System.Int32)
Returns true if the AcDbCompoundObjectId is valid. The given
validityCheckingLevel specifies the level of testing. Bigger number means
more thorough checks are being performed. At this moment the
validityCheckingLevel argument is unused but will be used in the future.

AcDbCompoundObjectId.isEmpty
Checks if the AcDbCompoundObjectId contains no data.

AcDbCompoundObjectId.setFullPath(AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbDatabase*)
Sets this AcDbCompoundObjectId from the path that contains the
path of AcDbBlockReferences apppended by the leaf AcDbObjectId.
fullPath:  The path of AcDbBlockReferences and the leaf level
object itself as the last element of the array.
pHostDatabase:  The host database. If null, the database
is taken from the first AcDbBlockReference id in the fullPath.
Returns:  Acad::ErrorStatus.

AcDbCompoundObjectId.set(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbDatabase*)
Sets this AcDbCompoundObjectId from an ordinary AcDbObjectId and a path
of AcDbBlockReferences. If the host database is null, the host database
is obtained from the first id in the path. Even if it is in XREF database,
the database hosting the XREF is obtained.
id:  AcDbObjectId of the AcDbObject that this AcDbCompoundObjectId
is going to reference.
path:  The path of AcDbBlockReferences that lead to the
referenced object. The first AcDbBlockReference in the path resides in the
host database, the second AcDbBlockReference is from the AcDbBlockTableRecord
that the first AcDbBlockReference references, the third AcDbBlockReference
is from the AcDbBlockTableRecord that the second AcDbBlockReference
references, etc.
pHostDatabase:  The host database. If null, the database
is taken from the first AcDbBlockReference id in the path (even if it is
in XREF database).
Returns:  Acad::ErrorStatus.

AcDbCompoundObjectId.set(AcDbCompoundObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbDatabase*)
Sets this AcDbCompoundObjectId from another AcDbCompoundObjectId.

AcDbCompoundObjectId.set(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbDatabase*)
Sets this AcDbCompoundObjectId from an ordinary AcDbObjectId. If the
host database is null, the host database is obtained from the given
AcDbObjectId. Even if it is in XREF database, the database hosting the
XREF is obtained.
id:  AcDbObjectId of the AcDbObject that this AcDbCompoundObjectId
is going to reference.
pHostDatabase:  The host database. If null, the database
is taken from the AcDbObjectId (even if it is in XREF database).

AcDbCompoundObjectId.setEmpty
Sets the AcDbCompoundObjectId to be empty, containing no data.

AcDbCompoundObjectId.getPath(AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the AcDbBlockReference path.

AcDbCompoundObjectId.getFullPath(AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the full path, i.e. the given path of AcDbBlockReference
ids appended with the leaf AcDbObjectId.

AcDbCompoundObjectId.leafId
Returns the leaf-node AcDbObjectId that resides in the
AcDbBlockTableRecord that the last AcDbBlockReference in the path references,
or simply the AcDbObjectId if there is no path.

AcDbCompoundObjectId.topId
Returns the first AcDbObjectId (of an AcDbBlockReference)
in the path, or the leaf-node AcDbObjectId, if there is no path.

AcDbCompoundObjectId.#ctor(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbDatabase*)
Creates AcDbCompoundObjectId from an ordinary AcDbObjectId and a path
of AcDbBlockReferences. If the host database is null, the host database
is obtained from the first id in the path. Even if it is in XREF database,
the database hosting the XREF is obtained.
id:  AcDbObjectId of the AcDbObject that this AcDbCompoundObjectId
is going to reference.
path:  The path of AcDbBlockReferences that lead to the
referenced object. The first AcDbBlockReference in the path resides in the
host database, the second AcDbBlockReference is from the AcDbBlockTableRecord
that the first AcDbBlockReference references, the third AcDbBlockReference
is from the AcDbBlockTableRecord that the second AcDbBlockReference
references, etc.
pHostDatabase:  The host database. If null, the database
is taken from the first AcDbBlockReference id in the path (even if it is
in XREF database).

AcDbCompoundObjectId.#ctor(AcDbCompoundObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy constructor.

AcDbCompoundObjectId.#ctor(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbDatabase*)
Creates AcDbCompoundObjectId from an ordinary AcDbObjectId. If the
host database is null, the host database is obtained from the given
AcDbObjectId. Even if it is in XREF database, the database hosting the
XREF is obtained.
id:  AcDbObjectId of the AcDbObject that this AcDbCompoundObjectId
is going to reference.
pHostDatabase:  The host database. If null, the database
is taken from the AcDbObjectId (even if it is in XREF database).

AcDbCompoundObjectId.#ctor
The default constructor creates an empty AcDbCompoundObjectId.

AcDbCompoundObjectId
Class used to identify an AcDbObject in an AcDbDatabase when the object is
references via a path of AcDbBlockReferences, and possibly by some other
ways in the future. The object may reside in the host database (the same
database as the AcDbCompoundObjectId belongs to) or it may reside in an XREF
database or even in an unrelated database.
Notice that if the AcDbCompoundObjectId references an object in another
database, reactors will be created to keep tract of relevant events happening
to the database, such as database deletion or XREF unload/reload.